@p0fi I'm still not able to reproduce this locally! Here's what I'm doing:

```
bash-3.2$ rm -rf .archive .terraform terraform.tfstate
bash-3.2$ cat repro.tf
resource "local_file" "default" {
  content = "random text here"
  filename = "${path.module}/.archive/index.js"
}

data "archive_file" "default" {
  type        = "zip"
  source_file = "${path.module}/.archive/index.js"
  output_path = "${path.module}/.archive/index.zip"

  depends_on = [
    local_file.default
  ]
}
bash-3.2$ terraform -version
Terraform v0.12.24
bash-3.2$ terraform init

Initializing the backend...

Initializing provider plugins...
- Checking for available provider plugins...
- Downloading plugin for provider "archive" (hashicorp/archive) 1.3.0...
- Downloading plugin for provider "local" (hashicorp/local) 1.4.0...

The following providers do not have any version constraints in configuration,
so the latest version was installed.

To prevent automatic upgrades to new major versions that may contain breaking
changes, it is recommended to add version = "..." constraints to the
corresponding provider blocks in configuration, with the constraint strings
suggested below.

* provider.archive: version = "~> 1.3"
* provider.local: version = "~> 1.4"

Terraform has been successfully initialized!

You may now begin working with Terraform. Try running "terraform plan" to see
any changes that are required for your infrastructure. All Terraform commands
should now work.

If you ever set or change modules or backend configuration for Terraform,
rerun this command to reinitialize your working directory. If you forget, other
commands will detect it and remind you to do so if necessary.
bash-3.2$ find .                                                                                                                                              
.
./.terraform
./.terraform/plugins
./.terraform/plugins/darwin_amd64
./.terraform/plugins/darwin_amd64/lock.json
./.terraform/plugins/darwin_amd64/terraform-provider-local_v1.4.0_x4
./.terraform/plugins/darwin_amd64/terraform-provider-archive_v1.3.0_x4
./repro.tf
bash-3.2$ terraform apply

An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
  + create
 <= read (data resources)

Terraform will perform the following actions:

  # data.archive_file.default will be read during apply
  # (config refers to values not yet known)
 <= data "archive_file" "default"  {
      + id                  = (known after apply)
      + output_base64sha256 = (known after apply)
      + output_md5          = (known after apply)
      + output_path         = "./.archive/index.zip"
      + output_sha          = (known after apply)
      + output_size         = (known after apply)
      + source_file         = "./.archive/index.js"
      + type                = "zip"
    }

  # local_file.default will be created
  + resource "local_file" "default" {
      + content              = "random text here"
      + directory_permission = "0777"
      + file_permission      = "0777"
      + filename             = "./.archive/index.js"
      + id                   = (known after apply)
    }

Plan: 1 to add, 0 to change, 0 to destroy.

Do you want to perform these actions?
  Terraform will perform the actions described above.
  Only 'yes' will be accepted to approve.

  Enter a value: yes

local_file.default: Creating...
local_file.default: Creation complete after 0s [id=d3478ca1ac457c6940cf420e2313ddcfa43cb57a]
data.archive_file.default: Refreshing state...

Apply complete! Resources: 1 added, 0 changed, 0 destroyed.
bash-3.2$ find .
.
./terraform.tfstate
./.archive
./.archive/index.js
./.archive/index.zip
./.terraform
./.terraform/plugins
./.terraform/plugins/darwin_amd64
./.terraform/plugins/darwin_amd64/lock.json
./.terraform/plugins/darwin_amd64/terraform-provider-local_v1.4.0_x4
./.terraform/plugins/darwin_amd64/terraform-provider-archive_v1.3.0_x4
./repro.tf
bash-3.2$ unzip ./.archive/index.zip
Archive:  ./.archive/index.zip
  inflating: index.js
bash-3.2$ cat index.js
random text here
```

That zip archive is definitely being created, at least using this reproduction process. Any other steps on your side that may be needed?